{"pageProps":{"post":{"title":"La ultima vez que cambie de trabajo","date":"2021-08-22T00:00:00.000Z","slug":"new-job","content":"<p>La última vez que cambié de trabajo también cambió mi perspectiva al ver los puestos de trabajo en las diferentes empresas. Durante ese momento estaba terminando la relación con un proyecto con el que colaboraba y lo siguiente que comencé a reflexionar sobre cuál sería el siguiente proyecto con el que me iba a encontrar.</p>\n<p>La empresa para la que trabajaba pertenecía al modelo de empresas de software que es muy común en México u otros países latinoamericanos, haciendo nearshore para empresas de Estados Unidos o el extranjero, por lo tanto, una vez terminada esa relación de trabajo con un cliente tendrías que ser asignado al siguiente y así mientras dures en esa empresa.</p>\n<p>Un par de años antes de ese momento había identificado una realidad con la que no estaba de acuerdo, me tocó ser parte de dos proyectos bajo este mismo modelo y me di cuenta que realmente no disfrutaba trabajar para estos proyectos, no compartía la visión u el objetivo de la empresa y solo estaba ahí porque ese era mi trabajo.</p>\n<p>Durante ese momento viva bajo un mantra que había desarrollado</p>\n<blockquote>\n<p>Es responsable aceptar cosas con las que no estamos de acuerdo.</p>\n</blockquote>\n<p>En ese momento ese mantra me hacía mucho sentido, no todo el tiempo íbamos a estar de acuerdo con las situaciones que se daban en nuestras vidas y es responsable enfrentar esos problemas.</p>\n<p>Hubo un momento entre esos dos proyectos en el que me tocó colaborar para uno que si disfrute demasiado; el equipo, la metodología, la tecnología, etc. Sabía que ese modelo era el modelo en el que quería seguir, a diferencia de los otros dos proyectos mencionados, este era 100% in-house, había cierta comunicación con el cliente pero nosotros nos hacíamos cargo de todo el todo.</p>\n<p>Los otros dos proyectos estaban basados en una estrategia de Outsourcing llamada \"Staff augmentation\", donde básicamente tú trabajas para una empresa y eres asignado como recurso al equipo del cliente.</p>\n<p>Para mi, la gran diferencia entre estos dos modelos es, que en el primero, el equipo funcionaba de forma integral, conocías a las personas con las que trabajabas y confiabas en ellos, mientras que en el segundo, tenías que creer en lo que el equipo del cliente creía, tenías que casarte con la visión del producto sin ni siquiera tener tiempo para conocerlo completamente.</p>\n<p>Usualmente las empresas que trabajan bajo este modelo están tratando de desarrollar alguna funcionalidad muy puntual, algún MVP que posteriormente el cliente se pueda llevar y validar de forma rápida sin tener que invertir recursos en desarrollarlo, mantenimiento de sistemas legacy que nadie quiere tocar o tal vez crear un producto disruptivo completamente fantástico que marcará la nueva generación de un mercado. Pero todo esto al final es una moneda al aire.</p>\n<h2>Buscando a tu empresa sonada</h2>\n<p>Durante este proceso de reflexión me quedo muy claro con quien si quería trabajar y con quien no, comencé a investigar a las empresas con las que más cercano me sentía, ya sea como usuario o por que seguía sus historias y logros de cerca; Personalmente me encantan los productos financieros o educativos, empresas que estén generando un cambio importante en los servicios financieros o plataformas de education en línea, que estén formando a los futuros profesionales en cada área.</p>\n<p>Finalmente entendí que solo así podría encontrar más empresas que usaran ese modelo que tanto me gustó en ese proyecto in-house hacía algunos años, ya que es más fácil compartir la visión de una empresa cuando esta se alinea con tus objetivos.</p>\n<p>Lo único que le hacía falta a este modelo que tanto me gustaba, era \"amar\" el producto que estabas construyendo. Creo que es importante enamorarse del proyecto en el que se está trabajando, ya que solo así vas a explotar tu potencial al máximo y de lo contrario, hasta pudiera ser nocivo para el proyecto.</p>\n<p>He conocido founders con los que mi visión simplemente no se alinea, están construyendo y poniendo su pasión, tiempo y esfuerzo en un proyecto que yo no puedo amar de la misma forma que ellos lo hacen, y esto que yo trabaje en esos proyectos puede poner en riesgo el éxito del mismo, ya que me será muy difícil entender el cambio que estamos tratando de lograr.</p>\n<h2>No te personifiques como una persona técnica</h2>\n<p>Como el estudiante de Ingeniería que en algún momento fui, creo que todos tenían la misma idea al graduarse: Crear o trabajar para una empresa que se encargará de desarrollar productos de software para otras empresas, un modelo muy similar a las fábricas, otros veían más el modelo de consultoría de software, donde uno como \"profesional\" en el área le da soporte a otras empresas de diferentes ramos con sus soluciones tecnológicas y finalmente el sueño de todo desarrollador, trabajar en Microsoft, Google, Facebook, etc.</p>\n<p>Para una pequeña <a href=\"https://www.beyond.dev/people/jerome-olvera\">entrevista que tuve con el equipo de Beyond</a>, dije algo como:</p>\n<blockquote>\n<p>\"No te personifiques como una persona técnica, sé un colaborador que quiere ayudar a toda la empresa.\"</p>\n</blockquote>\n<p>Este nuevo mantra me ayudo a tirar ala <em>basura</em> la idea de que \"era responsable aceptar cosas con las que no estamos de acuerdo\", no está bien aceptar cosas con las que no estás de acuerdo.</p>\n<p>Como profesional de cualquier área, tienes habilidades técnicas que te permiten desarrollar algún objetivo, como desarrollar software, hacer contabilidad o tienes las habilidades artísticas para pintar una gran obra.</p>\n<p>Estas habilidades si no tienen un enfoque, difícilmente van a ser útiles, porque puedes ser la persona con el conocimiento matemático más grande del mundo, ¿Pero con qué propósito? y cuando hablo de ser un colaborador más que solo una persona técnica, es que encuentres ese objetivo y apliques todo lo que sabes en materia técnica para cumplirlo.</p>\n<p>Recuerdas el famoso \"You've Got to Find What You Love\" de Steve Jobs, creo que puedo interpretar a que no tienes que ser un ciego persiguiendo tus sueños, pero si tener un objetivo y qué enfoques eso para lo que eres muy bueno en cumplirlo, solo o de la mano de alguien mas que tenga el mismo objetivo que tu.</p>\n<blockquote>\n<p>The only way to be truly satisfied is to do what you believe is great work.</p>\n</blockquote>\n<h2>Conclusion</h2>\n<p>No creo que todo en el Nearshore, Outsourcing o Consulting sean malos, de hecho son increíbles oportunidades para todos, es una forma accesible de trabajar con empresas que tiene una forma diferente de ver las cosas, las cosas en esas empresa ocurren muy rápido, se toman decisiones agresivas y la competitividad técnica es alta. Por lo que creo que son los mejores lugares para comenzar tu carrera y llevarlas hasta tu mid-term.</p>\n<p>Tampoco creo que hay que apuntar a trabajar en las empresas Tops, es posible que ahí se encuentren los mejores de los mejores en un nivel técnico, pero recuerda que tienes que creer en lo mismo que todas empresas creen. Si tuviera la oportunidad de llegar a una de esas grandes empresas en el futuro Apple sería mi elección, creo que están haciendo que pueden mejorar nuestra vida a través de la tecnología.</p>\n<p>Finalmente, hay una gran oportunidad de aprender y de escalar tu potencial a lo largo de tu carrera a través de tomar <em>ownership</em> de tus objetivos, este ultimo video (que también es de Steve Jobs), habla sobre <a href=\"https://www.youtube.com/watch?v=4n6LrehCPOQ\">\"Skin In The Game\"</a> y lo que sucede cuando pasas mucho tiempo construyendo objetivos que no son tuyos.</p>\n","cover":{"alt":"black framed eyeglasses on white surface photo – Free Business Image on Unsplash by @konseptastudio","src":"new-job.jpg"},"excerpt":"No te personifiques como una persona técnica, sé un colaborador que quiere ayudar a toda la empresa. Entiende el objetivo en el que tú crees y el objetivo en el que cree tu empresa."}},"__N_SSG":true}