{"pageProps":{"post":{"title":"¿Por que lance mi propia marca café?","date":"2023-09-02T00:00:00.000Z","slug":"redactado","content":"<p>En julio de 2023, lancé mi propia marca de café. Lo hice principalmente porque buscaba la manera perfecta de disfrutar el café tal y como me gusta. Esta marca me ha brindado la oportunidad de mantener un flujo de importación constante desde diversas partes del mundo. Nos enfocamos en tener cafes que simplemente se describan como algo diferente, ya sea debido a su proceso de producción, su origen o su sabor. Contamos con cafés de Colombia, África y Asia.</p>\n<h2>¿Por que el nombre?</h2>\n<p>La primera vez que escuché la palabra \"Redactado\" fue mientras jugaba Destiny 2. En cada anuncio sobre las próximas actualizaciones, utilizaban el término [Redactado] para ocultar detalles, preservando así sorpresas y evitando spoilers. Esta práctica me hizo pensar en las sociedades secretas, en las que sus miembros usan palabras clave para comunicarse de forma codificada entre ellos.</p>\n<p>Es similar a cuando dos expertos en un tema específico intercambian información: desarrollan un lenguaje único que solo ellos comprenden. En el ámbito del café, cuando dos conocedores conversan, surgen términos y referencias que solo ellos captan en su totalidad. Por ello, elegí el nombre \"Redactado\" para mi marca: es un lenguaje que solo aquellos verdaderamente apasionados por el café pueden entender.</p>\n<h2>La experiencia de construir una marca</h2>\n<p>Desde hace tiempo, ya tenia la idea de crear una marca de café. Si bien investigaba ocasionalmente sobre cómo iniciar, la procrastinación solía ser mi principal obstáculo. La preocupación por detalles como la calidad, las etiquetas y los empaques me frenaba. Mientras más sobrepensaba en estos detalles, más dejaba pasar el tiempo y la motivación se perdía.</p>\n<p>Pero un buen dia mi esposa hizo mención de la idea y la motivación regreso. A pesar de que, al principio, retomé mis viejos hábitos de analizar de forma superficial los detalles, esta vez conté con un catalizador: la inteligencia artificial. En pleno auge de ChatGPT y otras tecnologías similares, me surgió una pregunta: ¿Qué tan rápido podría construir una marca con la ayuda de un AI? Si el desempeño de esta herramienta era tan destacado como se promocionaba, quizás podría tener una marca en días.</p>\n<p>Sorprendentemente, en poco tiempo tenía una marca con logo, nombre, eslogan, paleta de colores, sitio web y un plan de marketing, todo gracias al AI. Aunque el resultado no era perfecto, sí era bastante bueno. Utilicé herramientas como Dal-E y ChatGPT. Si bien no siempre implementé sus sugerencias al pie de la letra, estas herramientas me proporcionaron una base firme, aclararon mis dudas y agilizaron el proceso de inicio. Finalmente, yo hice a mano el diseño y nombre, aproveche herramientas low code para sitio web usando Notion e hice de Instagram mi principal canal de ventas y marketing.</p>\n<p>Uno de mis principales focos, la calidad del empaque y las etiquetas, lo resolví con una impresora doméstica y seleccionando bolsas de café estéticamente atractivas en Amazon. Una vez que tuve todos los componentes en mis manos, logré consolidar mi marca en tan solo dos semanas.</p>\n<h2>Los efectos secundarios de construir una marca</h2>\n<p>A lo largo del desarrollo de la marca, pude reafirmar creencias fundamentales. Siendo parte del nicho del café desde hace algún tiempo, he entablado amistades con otros aficionados, algunos de los cuales también tienen sus propias marcas, ya sea a través de una cafetería o como productores.</p>\n<p>Como consumidor, siempre he respaldado las marcas que aprecio, no solo comprando sus productos, sino también promoviéndolos. La misión de mi marca no es saturar el mercado. En cambio, busco crear algo que pueda compartir con amigos y conocidos, un producto de calidad del cual este orgulloso y que otros puedan disfrutar.</p>\n<p>La promoción de mi marca ha sido sencilla: compartir y disfrutar con otros, al igual que como consumidor. A través de una estrategia orgánica, regalé muchos de mis primeros productos, incentivando a los consumidores a visitar cafeterías locales y, de paso, descubrir mi marca.</p>\n<p>Personalmente, creo que iniciar con una gran inversión y ambiciones desmedidas puede ser un error. Para mi es triste ver empresas abrir y cerrar rápidamente, tras haber invertido tanto esfuerzo y capital, ya que entiendo el sacrificio esfuerzo que se puso en realizarlo. También ver marcas y productos de las que era muy fan desaparecer.</p>\n<p>En lugar de eso, sugiero comenzar pronto, probar la idea con cercanos, aprovechar medios de promoción gratuitos, y antes de hacer grandes inversiones, validar el concepto. La idea de, \"iniciar pronto\" no significa sacrificar calidad, sino hacer lo mejor posible en ese momento y mejorar con el tiempo.</p>\n<p>Durante la pandemia, observé a muchas personas seguir esta practica de forma inconsciente, vendiendo productos y servicios a través de redes sociales y WhatsApp, empezando con su círculo cercano y expandiéndose gradualmente.</p>\n<p>Como consumidores y productores, tenemos una responsabilidad hacia la economía local. Sin embargo, eso no significa restringirse únicamente a lo local y artesanal, sino apoyar lo que consideremos valioso y de calidad. Somos responsables de mantener vivos los productos y servicios que apreciamos, incluso si eso implica pagar un poco más por algo de mayor calidad.</p>\n<p>Por último, la competencia en el mundo empresarial debe ser sana. Aunque el mundo de los negocios es inherentemente competitivo, es crucial evitar prácticas dañinas. Un mercado con una única opción es estéril; la diversidad y la calidad deben prevalecer.</p>\n","cover":{"alt":"Patron de marca redactado","src":"redactado.png"},"excerpt":"En Julio del 2023 lance mi propia marca de café, principalmente por que quería encontrar la mejor forma de tomar siempre el café a mi me gusta. Motivado por la idea de construir una marca con ayuda de AI, pude construir la marca en 2 semanas. Durante este proceso descubrí que la mejor forma de construir una marca es comenzar con lo que ya tienes, compartir y disfrutar."}},"__N_SSG":true}