{"pageProps":{"post":{"title":"No te autodenomines CEO... aún","date":"2024-04-11T00:00:00.000Z","slug":"ceo","content":"<p>En mis tiempos de estudiante de ingeniería, cuando mis compañeros y yo pensábamos en a qué nos dedicaríamos al graduarnos, la idea común era que podríamos fundar nuestra propia empresa de software. Siempre los que lideraban esta idea, ya fuera solos o formando un grupo de 'freshmen', se autodenominaban directores, gerentes, jefes, y en cualquiera de los casos, algún cargo de C-level: CEO, CTO, COO, etc.</p>\n<p>Durante todo el tiempo antes de la universidad, al observar a mis padres atender sus empleos, me resultaba familiar asociar que los roles de poder en una empresa, como directores o gerentes, tenían una posición de privilegio a la que únicamente podías aspirar cuando tenías alguna influencia que te ayudara a llegar allí. Por lo tanto, me parecía natural pensar o entender que si tenías la idea de fundar una empresa, tenías el privilegio o la autoridad de autoproclamarte con alguno de esos títulos.</p>\n<h2>El modelo de IC</h2>\n<p>Varios años después de esa etapa de la universidad y ya habiendo consolidado mi carrera profesional, me topé con un modelo de carrera que me pareció muy interesante y que me hizo reflexionar sobre el tema de los títulos y roles en una empresa. El modelo de 'Individual Contributor' (IC) se refiere a un rol en el que una persona se dedica a aportar valor a la empresa a través de su trabajo, sin tener a cargo a otras personas.</p>\n<p>Este modelo, pienso, es más común en las empresas de tecnología donde, como profesional, puedes optar por un camino 'técnico' o 'de liderazgo'.</p>\n<p>En el camino técnico, puedes llegar a ser un experto en tu área y aportar valor a la empresa a través de tu trabajo, sin tener que preocuparte por la gestión de personas. En el camino de liderazgo, puedes llegar a ser un líder de equipo, gerente, director, etc., y aportar valor a la empresa a través de la gestión de personas.</p>\n<p>Dentro de los roles técnico o de liderazgo, hay escalones de 'niveles' que puedes alcanzar, como si de un RPG se tratara, y cada nivel tiene un rango de responsabilidades y expectativas que debes cumplir para poder avanzar al siguiente nivel. La primera vez que vi este modelo, se me asignó un nivel y con dicho nivel, se me mostró lo que era necesario para poder avanzar al siguiente nivel y, de forma ambiciosa, me propuse entender los puntos de valor que eran necesarios para cumplir con las expectativas del siguiente nivel.</p>\n<h3>Que es un Ingeniero Senior?</h3>\n<p>Cuando inicias en el software, hay una ambición por parte de los ingenieros de ser referidos como Ingenieros Senior, un título que conlleva respeto y se asocia con la experiencia y el conocimiento. Pero, ¿qué es un Ingeniero Senior? Esa gran pregunta que todos nos hacemos al iniciar en el mundo del software y que no tiene una respuesta clara. Honestamente, la definición de 'Senior' es muy ambigua y depende mucho de la empresa y del contexto en el que te encuentres.</p>\n<p>Existe una curva de confianza que los ingenieros más avivados tienen cuando aprenden muchas tecnologías y se vuelven muy hábiles en estas, pero el nivel de Senior no se trata de cuántas tecnologías conoces o cuántas líneas de código puedes escribir en un día. También hay una curva de seguridad que poseen los ingenieros que llevan más años trabajando, ya sea para una empresa o en general en la industria, pero el nivel de Senior no se trata de cuántos años llevas trabajando.</p>\n<p>Según la referencia de Sarah Drasner en <a href=\"https://career-ladders.dev/engineering\">Career Ladders</a>, que me parece muy acertada, esta utiliza una combinación de tiempo + habilidades. Más que una lista de tecnologías por aprender, es una lista de habilidades que un profesional debe tener para poder ser considerado un Ingeniero Senior. (Spoiler: Basado en la referencia de Career Ladders hay aun tres niveles mas arriba de Senior Engineer).</p>\n<blockquote>\n<p>Senior Engineer. At this point, a person is mastering how effective they can be as an individual contributor.</p>\n<ul>\n<li>Defines and executes on an execution plan for specific features or internal system maintenance/upgrade.</li>\n<li>Actively participates in Engineering efforts that help streamline the experience of our Product.</li>\n<li>Helps support the work of their peers by pair programming, reviewing, and providing mentoring.</li>\n<li>Adjusts well to shifting priorities when necessary.</li>\n<li>Strives to reduce technical debt, while communicating with teammates about any larger refactor.</li>\n<li>Works to understand the purpose of the features the team is working on, and helps communicate that purpose to team members. Asks clarifying questions when expectations are unclear.</li>\n<li>When tasks are large, works on scoping work down into smaller, actionable parts.</li>\n<li>Demonstrates openness to others’ ideas. Adapts their communication style to most effectively communicate. Effectively and accurately shares credit for ideas and collaborative efforts.</li>\n<li>Structures code in a manner that anticipates the type of scale and maintenance required for the scope of the work. Considers legibility both in authoring and reviewing pull requests.</li>\n<li>Experience: Typically requires a minimum of 5 years of professional experience.</li>\n</ul>\n</blockquote>\n<h3>Que es un manager?</h3>\n<p>Entonces, en el camino de liderazgo, ¿qué es un manager? ¿Un gerente? ¿O el siempre temido 'jefe'? El camino de liderazgo es un camino que se puede tomar si te interesa la gestión de personas y el desarrollo de equipos. En este camino, el título de manager es el más común y se refiere a una persona que tiene a cargo un equipo de personas y es responsable de la gestión de dicho equipo.</p>\n<p>El liderazgo no tiene nada que ver con la autoridad que una persona ejerce sobre otras, ni con los amigos e influencias que esta persona tiene en la empresa. Un líder es una persona que patrocina a su equipo, que se preocupa por el desarrollo de las personas que lo conforman y que se preocupa por el bienestar de su equipo.</p>\n<p>El camino de liderazgo es algo que se debe tomar con responsabilidad y profesionalismo. No es algo que una persona pueda autodenominarse; es algo que una persona debe ganarse a través de su trabajo y su dedicación, al igual que el nivel de Senior en el camino técnico.</p>\n<blockquote>\n<p>Algo que siempre debemos tener en mente es que cuando se gana un manager, se puede estar perdiendo a un Senior. Y a veces, se puede estar perdiendo un buen ingeniero para ganar un mal manager.</p>\n</blockquote>\n<h3>Conclusión</h3>\n<p>La primera vez que se me presentó el siguiente nivel en mi carrera para llegar a ser un Staff Engineer, no tenía ni idea de las capacidades que podía o tenía aún por desarrollar. Mi ambición me llevaba a solo querer autodenominarme como Staff, pero siempre había algo que me decía que no estaba listo aún. Con el tiempo y la experiencia, dejó de importarme el título y me enfoqué en ser y seguir siendo un excelente ingeniero. Cuando menos lo esperaba, me di cuenta de que ya había alcanzado el nivel que tanto quería.</p>\n<p>Hay cosas que no dependen puramente del tiempo, pero el tiempo es un ingrediente necesario para poder alcanzar ciertos niveles. No te apresures a querer ser algo que aún no eres; enfócate siempre en ser un excelente profesional.</p>\n<p>Personalmente, solía siempre rechazar las palabras 'líder' o 'jefe' porque más que la responsabilidad y el profesionalismo, solo encontraba en dichas palabras la idea de poder y la autoridad. Aunque honestamente dejé de rechazarlas, ahora las veo como un escalón más en el camino que alguien puede tomar en su carrera profesional.</p>\n<p>Un manager me dijo una vez que Steve Jobs decía que los mejores managers eran grandes contribuidores individuales que no querían ser managers, pero decidían serlo porque nadie más podría hacer un mejor trabajo que ellos.</p>\n","cover":{"alt":"black and white photo of couch – Photo by Marius Ciocirlan on Unsplash","src":"black-and-white-photo-of-couch.jpg"},"excerpt":"En mis tiempos de estudiante de ingeniería, cuando mis compañeros y yo pensábamos en a qué nos dedicaríamos al graduarnos, la idea común era que podríamos fundar nuestra propia empresa de software. Siempre los que lideraban esta idea, ya fuera solos o formando un grupo de 'freshmen', se autodenominaban directores, gerentes, jefes, y en cualquiera de los casos, algún cargo de C-level: CEO, CTO, COO, etc."}},"__N_SSG":true}