{"pageProps":{"posts":[{"slug":"determinacion","title":"Las lecciones mas importantes que los videojuegos me han enseñado","date":"2024-05-31T00:00:00.000Z","excerpt":"Enfócate en tus objetivos, desarrolla la determinación y ayuda a otros una vez los alcances. Juegos como 'Undertale' y libros como 'Clean Coder' enseñan el valor de completar lo que comenzamos. No dejes que las redes sociales manipulen tus emociones y distraigan tu enfoque."},{"slug":"ceo","title":"No te autodenomines CEO(o Senior o Director, etc.)... aún","date":"2024-04-11T00:00:00.000Z","excerpt":"En mis tiempos de estudiante de ingeniería, cuando mis compañeros y yo pensábamos en a qué nos dedicaríamos al graduarnos, la idea común era que podríamos fundar nuestra propia empresa de software. Siempre los que lideraban esta idea, ya fuera solos o formando un grupo de 'freshmen', se autodenominaban directores, gerentes, jefes, y en cualquiera de los casos, algún cargo de C-level: CEO, CTO, COO, etc."},{"slug":"salud","title":"No entiendo el sistema de salud","date":"2023-11-11T00:00:00.000Z","excerpt":"Un viaje personal a través de la confusión y el aprendizaje sobre el sistema de salud"},{"slug":"clean-arquitecture","title":"La arquitectura limpia no existe","date":"2023-11-09T00:00:00.000Z","excerpt":"Contrario a lo que muchos asocian con Clean Architecture, el libro de Robert C. Martin no se limita a las cuatro capas propuestas en su famoso artículo, ni se enfoca en una prescripción rígida de la estructura de carpetas — salvo por una breve discusión en el último capítulo."},{"slug":"agile","title":"Cuando verdaderamente entendí Agile","date":"2023-10-14T00:00:00.000Z","excerpt":"Explorando la relación entre Agile y videojuegos, descubrimos similitudes sorprendentes en colaboración, adaptabilidad y enfoque en objetivos claros. Así como en los desafíos de un juego se requiere comunicación y estrategia, Agile destaca por las interacciones humanas y la entrega de valor. No se trata solo de técnicas, sino de comprender y vivir valores."},{"slug":"soft-skills","title":"Soft Skills para Ingenieros","date":"2023-09-30T00:00:00.000Z","excerpt":"Técnicas para mejorar la comunicación, gestión de proyectos y resolución de problemas."},{"slug":"redactado","title":"¿Por que lance mi propia marca café?","date":"2023-09-02T00:00:00.000Z","excerpt":"En Julio del 2023 lance mi propia marca de café, principalmente por que quería encontrar la mejor forma de tomar siempre el café a mi me gusta. Motivado por la idea de construir una marca con ayuda de AI, pude construir la marca en 2 semanas. Durante este proceso descubrí que la mejor forma de construir una marca es comenzar con lo que ya tienes, compartir y disfrutar."},{"slug":"serverless","title":"Aplicaciones Serverless","date":"2023-07-20T00:00:00.000Z","excerpt":"Serverless es un enfoque de desarrollo de aplicaciones en la nube en el cual los desarrolladores se centran en escribir código de funciones individuales que se ejecutan en respuesta a eventos específicos."},{"slug":"react-in-theory","title":"React en teoría","date":"2022-01-09T00:00:00.000Z","excerpt":"Probable que en el futuro algo pudiera reemplazar a React como biblioteca, confió en que el `modelo` de React prevalecería por mucho más tiempo."},{"slug":"new-job","title":"La ultima vez que cambie de trabajo","date":"2021-08-22T00:00:00.000Z","excerpt":"No te personifiques como una persona técnica, sé un colaborador que quiere ayudar a toda la empresa. Entiende el objetivo en el que tú crees y el objetivo en el que cree tu empresa."},{"slug":"personal-finance","title":"Todo lo que sé sobre finanzas personales","date":"2021-07-31T00:00:00.000Z","excerpt":"Las finanzas personales son una disciplina que cada persona debe desarrollar, y como muchas experiencias en la vida, es algo que solo se aprende por memoria y conociendo experiencias de otras personas."},{"slug":"clean-agile","title":"Clean Agile y volviendo a los basics","date":"2021-07-17T00:00:00.000Z","excerpt":"Después de tener un gran interés por entender los principios de agile, pude entender donde fallamos como equipos al intentar adoptar los principios"}]},"__N_SSG":true}