{"pageProps":{"post":{"title":"No entiendo el sistema de salud","date":"2023-11-11T00:00:00.000Z","slug":"salud","content":"<blockquote>\n<p>El jueves 15 de junio comencé con una fuerte comezón en la pierna durante el mediodía, la cual se extendió por todo el cuerpo.</p>\n</blockquote>\n<p>Esta oración la he repetido constantemente en los últimos meses desde que enfermé. Los recientes eventos de salud me han llevado a cuestionar el sistema de salud y a darme cuenta, una vez más, de que no entiendo cómo funciona. Desde niño, mis padres, responsables de mi cuidado, me llevaban a urgencias cuando me enfermaba y describían mis síntomas al doctor.</p>\n<p>Desde que me independicé, me di cuenta que al no vivir bajo el mismo techo que mis padres, no podía acceder a los mismos beneficios médicos que ellos tenían debido a cómo funciona el seguro social en México. Así, durante mi etapa universitaria y los primeros años de trabajo, viví, creo que como muchos, confiando en mi suerte y esperando que nada malo ocurriera.</p>\n<p>En los peores casos, optaba por acudir a consultorios en farmacias, donde por una pequeña cantidad recibía atención médica de primer nivel. Describía mis síntomas al doctor, quien me recetaba algo para aliviar el dolor. Si todo salía bien, me curaba en un par de días. Pero, ¿qué pasa si no te curas? ¿Y si te sientes peor? Estas preguntas me atormentaban, deseando que nunca me ocurriera algo así.</p>\n<h2>El miedo a la incertidumbre</h2>\n<p>Uno de mis mayores temores era el coste elevado de una enfermedad grave y la ineficacia del seguro social, lo que dejaba como única alternativa pagar un seguro privado. ¿Pero qué pasa si no tienes dinero para un seguro privado? No podía dimensionar mentalmente el costo de una enfermedad o de mi salud en general; solo pensaba que fuera caro e inalcanzable.</p>\n<p>Durante mis primeros años de trabajo, sufrí una muela rota y, debido a la misma incertidumbre, decidí no atender el problema y aprender a vivir con el dolor. Con el tiempo, y al mejorar mi situación financiera, decidí tomar más responsabilidad sobre mi salud.</p>\n<p>En ese entonces, con 24 años, no tenía ni idea de cómo empezar una vez que decidí cuidar de mi salud. ¿Me iba a parar en un consultorio dental y pedir \"una salud para llevar\"? Comencé llamando al primer consultorio de la lista de especialistas de mi seguro dental. Investigando en Google, elegí un especialista que parecía adecuado para lo que yo pensase que fuera mi caso, llamé, hice una cita y me atendieron. Afortunadamente, caí en manos de un buen profesional que me explicó todo el proceso, me dio un presupuesto y me atendió. Así, mi incertidumbre y mi incapacidad para dimensionar lo que era caro o no en cuestiones dentales desapareció.</p>\n<p>Terminaron haciéndome una endodoncia, un poste y una corona debido a mi demora en buscar atención. El tratamiento costó aproximadamente $10,000 pesos, pero gracias al seguro pagué mucho menos. Al poder dimensionar el costo de mi salud, me di cuenta de que no era tan caro como pensaba en comparación con descuidar mi salud y llegar a tener, como en este caso, una padecimiento más grave.</p>\n<h2>A pesar de esto, no entiendo el sistema de salud</h2>\n<p>Ir al dentista ya me parecía algo manejable: haces una cita, el dentista te aconseja, te da un presupuesto y te atiende. Repites el proceso cada 6 o 12 meses.</p>\n<p>Retomando la idea inicial de este artículo, el jueves 15 de junio comencé a experimentar un intenso picor en la pierna durante el mediodía, que se extendió por todo el cuerpo. Acudí a una farmacia donde me recetaron antihistamínicos, pensando que podría ser una reacción alérgica. Aunque nunca he sido alérgico, el médico no descartó esa posibilidad. Seguí el tratamiento indicado, pero sin mejoría.</p>\n<p>La situación empeoró y acabé en urgencias esa noche, un poco mas confiado en mi seguro de gastos médicos mayores, fui a un hospital privado donde me trataron la comezón y me dieron algunos medicamentos y listo. El malestar mejoró ese día, pero durante el fin de semana, noté un patrón extraño: me sentía bien durante el día, pero la comezón regresaba por las noches.</p>\n<p>Una noche de martes, la comezón se intensificó. Informé a mi jefe que no asistiría al trabajo el resto de la semana y conseguí una cita con una dermatóloga recomendada. Me atendió, me receto algunos medicamentos, cambio un poco la docis original del medicamento que me habían recetado en urgencias y me dio de alta.</p>\n<p>Mi desconocimiento del sistema de salud me llevó a asumir que un dermatólogo era el especialista que necesitaba. Al fin y al cabo, tenía comezón y la piel enrojecida, lo cual, mara mi lógica, apuntaba hacia la dermatología. Surgió entonces la duda: ¿Debería acudir al mismo hospital privado donde me habían atendido en urgencias? ¿Era suficiente con presentarme en recepción y solicitar una consulta con un dermatólogo? Pronto descubrí que no era así de sencillo. Aunque los médicos tienen sus consultorios en estos hospitales, el proceso para conseguir una consulta no es tan directo como simplemente llegar y pedirla.</p>\n<p>Inicié un seguimiento más riguroso con esta dermatóloga, quien, tras realizar algunos análisis, diagnosticó que padecía Vasculitis Urticariana. Anteriormente, solía pensar que ser diagnosticado con una enfermedad \"rara\" implicaba algo catastrófico. Sin embargo, ahora comprendo que \"rara\" simplemente significa que las causas de la enfermedad son desconocidas o inusuales. Afortunadamente, esto no implica que no haya tratamiento o posibilidad de cura.</p>\n<p>Me trataron con corticoesteroides, medicamentos eficaces para controlar la inflamación, pero con efectos secundarios adversos si se usan a largo plazo. La dermatóloga trabajó para reducir gradualmente la dosis, pero cada intento resultaba en un retorno más intenso de la comezón. Tras mi diagnóstico, ella explicó que mi caso requería atención especializada y me derivó a un reumatólogo.</p>\n<p>Me facilitó el contacto de un especialista y, una vez más, acudí a este nuevo médico gracias a una recomendación directa. He observado que en el ámbito de la salud, muchas veces el acceso a especialistas parece depender de recomendaciones personales. Aunque no estoy seguro si esto es positivo o negativo, es una tendencia que he notado claramente.</p>\n<p>El reumatólogo solicitó más pruebas diagnósticas para determinar la severidad de mi enfermedad. Afortunadamente, hasta ese momento, todo parecía estar dentro de parámetros seguros. Comencé un tratamiento con otros inmunosupresores que, al parecer, no estaban surtiendo efecto. Fue entonces cuando me enfrenté por primera vez a medicamentos cuyos costos ascendían a 1,000, 3,000, incluso 5,000 pesos, abriendo ante mí una nueva dimensión en los costos asociados a la salud. Además, la lista de posibles efectos secundarios de estos fármacos era alarmantemente extensa; cada uno venía con advertencias que sugerían que su consumo podría ser letal.</p>\n<p>Durante el mismo seguimiento con el reumatólogo, me recomendó consultar a una alergóloga para descartar posibles desencadenantes de la enfermedad. Con la alergóloga, y una vez más por recomendación, buscamos determinar si existía algún activador. Tras confirmar que no había ninguno, discutimos sobre un medicamento biológico especializado, el cual representaba un nuevo nivel en la escala de costos: 12,000 pesos por dosis, con una aplicación necesaria cada mes.</p>\n<p>Hoy, después de cuatro meses desde que recibí la primera dosis de este último medicamento, el cual promete aliviar mi padecimiento, me siento absolutamente afortunado. Durante todo este proceso, siempre existió el riesgo asociado con el consumo continuado de corticosteroides, los cuales, por cierto, estaban perdiendo efectividad. Viví con el temor constante de que esta enfermedad pudiera estar acompañada de otra forma de vasculitis que comprometiera seriamente mi vida.</p>\n<p>En este breve lapso, ha sido un privilegio absoluto haber sido atendido por tres especialistas. Sin embargo, aquí radica lo desconcertante: la alergóloga me informó que el costoso medicamento que necesitaba estaba disponible a través del seguro social. No obstante, para acceder a él, tendría que atravesar un proceso que tomaría aproximadamente cuatro meses, y eso solo para obtener una cita. En ese momento, me percaté de que el sistema de salud en el que vivimos es un privilegio al que no todos tienen acceso, y que no todas las personas pueden permitirse.</p>\n<p>¡¿Me estan diciendo que en una situación menos afortunada, tras cuatro meses, apenas estaría comenzando a comprender mi enfermedad?!. ¿Qué habría ocurrido si mi padecimiento hubiese estado acompañado de otra forma de vasculitis, poniendo en riesgo mi vida? ¿Y si los medicamentos necesarios no hubiesen estado disponibles? ¿Me habría quedado viviendo con el dolor, simplemente esperando que la enfermedad desapareciera o, en su defecto, terminara con mi vida?</p>\n<p>Recientemente, conocí a alguien que estaba estudiando una especialidad médica. Como mencioné antes, creo firmemente que temas relacionados con la salud deberían enseñarse desde la crianza, en la escuela primaria. Si hubiera sabido y seguido los procedimientos adecuados, como consultar con mi médico familiar asignado por el seguro social –del cual, hasta hace poco, desconocía su existencia–, mi trayecto hacia una mejor salud habría sido distinto. Es una información crucial que, lamentablemente, nadie parece mencionar.</p>\n<p>Me compartió también que, desde su perspectiva como médico, el sistema de salud en el que vivimos es extremadamente complejo. Destacó las duras condiciones de trabajo de médicos, enfermeros y demás personal sanitario, quienes a menudo laboran en turnos dobles o triples, incluyendo guardias, por un salario ni un ambiente profesional adecuado. Esto plantea una reflexión importante: ¿cómo podemos esperar recibir un servicio de salud de calidad si el personal sanitario no se encuentra en las mejores condiciones para brindarnos atención?</p>\n<h2>Conclusiones</h2>\n<p>El sistema de salud en el que nos encontramos es, indudablemente, un privilegio. No todos tienen acceso a él, y no todos pueden permitírselo. Aunque es un sistema que no comprendo completamente, esta experiencia me ha llevado a valorar profundamente la salud y la capacidad de acceder a cuidados médicos. Asimismo, he desarrollado respeto por el trabajo incansable de médicos, enfermeros y todo el personal sanitario que desempeña sus funciones dentro de este sistema.</p>\n<p>A lo largo de este proceso, también recurrí a ChatGPT para comprender mejor mi enfermedad. Las herramientas tecnológicas actuales son verdaderamente asombrosas. Pude compartir con ChatGPT todo lo que he narrado en este artículo, incluyendo detalles adicionales, fechas y resultados de mis análisis. ChatGPT interpretó esta información y me orientó eficazmente sobre los siguientes pasos a seguir, así como qué esperar de cada especialista involucrado en mi tratamiento.</p>\n","cover":{"alt":"Photo by Hush Naidoo Jade Photography on Unsplash","src":"heal.jpg"},"excerpt":"Un viaje personal a través de la confusión y el aprendizaje sobre el sistema de salud"}},"__N_SSG":true}