{"pageProps":{"post":{"title":"Soft Skills para Ingenieros","date":"2023-09-30T00:00:00.000Z","slug":"soft-skills","content":"<p>El propósito de esta presentación no es solo hablar sobre las habilidades blandas genéricas, como liderazgo o comunicación, ni enfatizar su importancia en el ámbito profesional. En su lugar, quiero enfocar en técnicas específicas y situaciones cotidianas que todos enfrentamos, y cómo podemos maniobrar a través de estas.</p>\n<p>Me describo como una persona introvertida, una característica involuntaria de mi personalidad. Una manera en que he logrado desarrollarme profesionalmente es a través de la aplicación de técnicas definidas que me ayudan a superar bloqueos habituales.</p>\n<h2>¿Como comunicar?</h2>\n<p>Mis primeros pasos en la programación fueron motivados por eventos como Hackathons o Start Up Weekends, donde mi intención era conocer personas con intereses similares a los míos. En estos eventos, se insistía mucho en la manera de hacer presentaciones (\"el pitch\"). Ahí aprendí a crear presentaciones claras y directas.</p>\n<p>Recordando la norma de mis profesores, quienes solían desplegar presentaciones extensas con texto diminuto que debíamos copiar textualmente. Si puedo leer más rápido que tú o puedo revisar la información presentada en otro momento, ¿por qué necesitaría atenderte en primer lugar?</p>\n<p>Un salón en silencio, copiando o a veces el profesor leyendo lo ya escrito en la presentación. Es notable cómo este estilo de presentaciones pierde a la audiencia en los primeros minutos, y la retención de lo aprendido resultaba baja. Aunque siempre escuché “el que quiere aprender, aprende”, en realidad hay una responsabilidad del presentador para mantener a la audiencia atenta y comprendiendo lo que se está presentando. La simple pregunta de “¿Alguien tiene dudas?”, seguida por un coro de “No” no es suficiente confirmación de aprendizaje.</p>\n<p>Este mismo efecto se refleja en llamadas y reuniones. El más mínimo descuido del presentador puede hacer perder la atención de la audiencia en minutos. En las demos, los tiempos de carga o espera pueden desviar la atención de los participantes, y es nuestra responsabilidad mantener una conversación fluida y continua.</p>\n<p>Cuando algo falla, es crucial tener un plan de recuperación. Si algo se atasca o demora más de lo esperado, tener un respaldo listo para mantener la atención de las personas que nos están observando.</p>\n<p>Mantener el enfoque en el tema sin divagar asegura que todos en la sesión puedan seguir el hilo de la conversación. Si decidimos explorar nuevas ideas como forma de divergencia, siempre es necesario luego \"converger\", delimitar y concluir.</p>\n<p>Por ejemplo, cuando <a href=\"https://basecamp.com/shapeup\"><em>shapeamos</em></a> trabajo, tendemos a divergir en múltiples ideas, explorando toda la funcionalidad: enviar un nuevo email para este caso de error, o automatizar la carga de usuarios para hacerla más eficiente. Está bien darles una oportunidad a todas estas ideas, pero necesitamos concluir en el siguiente argumento:</p>\n<blockquote>\n<p>dada la cantidad de tiempo o esfuerzo que queremos invertir para resolver este problema, vamos a enfocarnos en cumplir [feature verdaderamente core] para el siguiente sprint y luego revisaremos si las otras alternativas se vuelven viables.</p>\n</blockquote>\n<p>...Es importante anotar las demas ideas.</p>\n<p>Durante una presentación, también es crucial conocer a tu audiencia y utilizar el lenguaje apropiado para mantener su atención. La atención de un stakeholder puede perderse tan rápido como al decir</p>\n<blockquote>\n<p>“Para lograr esta funcionalidad, tenemos que optimizar este proceso y refactorizar las funciones que nos permitan escalar los stored procedures, bla, bla, bla.”</p>\n</blockquote>\n<p>¿Es responsabilidad de nuestro stakeholder conocer nuestra área? No, es nuestra responsabilidad conocer el negocio.</p>\n<h2>¿Como liderar?</h2>\n<p>En las organizaciones, a menudo enfrentamos muchas malas sesiones. ¿Qué define a una mala sesión? La falta de un responsable claro de la sesión, una gran cantidad de personas haciendo “back-seat” (no participando), la ausencia de un objetivo claro (acudimos para resolver un problema y terminamos discutiendo cómo nos gustaría resolver otros 99 problemas), y la falta de acciones concretas a seguir.</p>\n<p>Ante estas situaciones, mi recomendación es la siguiente: si no hay un responsable claro (aunque haya un organizador), considera que acciones puedes ejecutar para dirigir la atención de la audiencia hacia un objetivo claro.</p>\n<p>Define un objetivo: “¿Qué queremos obtener de esta sesión?” y trabaja para lograrlo. Las sesiones que principalmente buscan solucionar o definir un problema, muchas veces se desvían hacia la necesidad de realizar actos heroicos o coordinar a múltiples equipos para abordar un problema masivo. Es cierto que, probablemente, estas grandes acciones sean necesarias para solucionar un gran problema. Pero las acciones más importantes son las que ocurren ahora, no en 3, 5 o 10 años. Las soluciones que nos acercan a nuestros objetivos son aquellas que podemos acordar solucionar en el corto o mediano plazo, de manera efectiva, y seguir avanzando.</p>\n<p>Soy un fanático de las listas y probablemente estaría perdido sin mi lista de recordatorios. Mi enfoque para abordar las tareas diarias consiste en enlistarlas, priorizarlas y seguir la lista. Mi lista de tareas tiende a expandirse y contraerse dinámicamente a lo largo del día, dado que las tareas complejas se desglosan en tareas más pequeñas. Y las únicas tareas que realmente me permiten avanzar son aquellas lo suficientemente delimitadas como para poder completarlas. No sé, tal vez si solo tuviera una tarea llamada “Hacer el Proyecto\", es probable que nunca dé un paso firme y concreto hacia “Hacer el Proyecto\".</p>\n<p>Por otro lado, las tareas excesivamente ambiciosas generan dos efectos comunes: la fatiga de intentar manejar algo tan ambicioso y la sensación de que no se está avanzando hacia la solución. Es probable que la solución que necesitabas podría haberse resuelto de forma mas directa, pero la ambición de buscar “La solución” hizo que nos perdiéramos en el camino. El segundo efecto común es que, cuando se comienza a delimitar de manera adecuada una solución ambiciosa, generando valor de forma continua y básicamente haciendo que el negocio funcione, te das cuenta de que tal vez “La solución” ni siquiera era tan crucial, y todo el proyecto termina en un destino muy distinto a “La solución”.</p>\n<h2>¿Como resolver problemas?</h2>\n<p>Todos tenemos intereses que deseamos proteger, personas a quienes reportar y nadie quiere ser señalado como culpable. Las malas sesiones suelen caracterizarse por estas dinámicas: “¿Cómo hago yo, para que <strong>tú</strong> hagas lo que <strong>yo</strong> necesito cumplir?” y otra persona estará pensando: “Si me pongo a hacer lo que <strong>tu</strong> quieres que haga, no voy a poder cumplir con lo que <strong>yo</strong> necesito hacer”.</p>\n<p>Esto es normal; en roles entre áreas multifuncionales somos roles adversariales por naturaleza, pero nuestra responsabilidad siempre radica en cómo generamos la mejor solución posible que beneficie a ambas partes.</p>\n<p>De \"Shark Tank\" aprendí que cuando uno gana en una negociación, el otro irremediablemente pierde, por lo que siempre hay que buscar un arreglo que genere interés para ambos. De lo contrario, lo único que voy a lograr es que, ni tú quieras trabajar conmigo y ni yo quiera trabajar contigo. Es en estos momentos cuando los equipos en general pierden, dado que cuando un integrante de un equipo pierde, todos los demás integrantes también se ven afectados irremediablemente.</p>\n<p>Por lo tanto, es crucial ser resiliente ante los problemas. Así, cuando en una sesión las cosas comienzan a descarrilarse, solo se pueden hacer dos cosas: si las personas son lo suficientemente resilientes, uno debe recuperar el objetivo de la sesión, hacer un llamado call-out: “A dónde queremos llegar, vamos a listar acciones y vamos a ejecutarlas”; por otro lado, si las personas no son lo suficientemente resilientes, lo mejor es concluir la sesión.</p>\n<p>Muchas sesiones podrían concluir en 30 minutos con la pregunta: “¿Qué necesitas y cómo te ayudo?”. En estas simples palabras yace la intención de resolver el problema, la magnitud en generar acciones concretas y responsables, y en tomar la propiedad de las cosas.</p>\n<h2>En conclusión</h2>\n<p>Los puntos que repasamos en esta sesión, enmarcan algunas técnicas cotidianas que como contribuidores individuales podemos ejecturar, las cuales irremediablemente van a generar un efecto positivo en las sesiones en las que participemos.\nIdentificar de forma activa estos patrones y comportamientos en las personas, nos ayudan a identificar acciones simples que cambian completamente el rumbo de cada sesión en la que participemos</p>\n<h2>Algunas referencias</h2>\n<p>https://staffeng.com/guides/</p>\n<p>https://www.amazon.com/Clean-Coder-Conduct-Professional-Programmers/dp/0137081073</p>\n<p>https://guykawasaki.com/the-only-10-slides-you-need-in-your-pitch/</p>\n","cover":{"alt":"Photo by Papaioannou Kostas on Unsplash","src":"softskils.jpg"},"excerpt":"Técnicas para mejorar la comunicación, gestión de proyectos y resolución de problemas."}},"__N_SSG":true}