{"pageProps":{"post":{"title":"React en teoría","date":"2022-01-09T00:00:00.000Z","slug":"react-in-theory","content":"<blockquote>\n<p>Este post fue originalmente publicado para <a href=\"https://medium.com/yellowme/react-in-theory-70379c23fbfc\">Yellowme en React In Theory</a>.</p>\n</blockquote>\n<p>Hace algún tiempo leyendo en Twitter, cuando Vue comenzaba a ganar popularidad, la comunidad le preguntó a Dan Abramov, \"The React Guru\" desde React 16, si el pensaba que en algún momento React como biblioteca sería reemplazada por alguna otra alternativa, señalando el ese tiempo a Vue.</p>\n<p>Respondió que era algo probable que en el futuro algo pudiera reemplazar a React como biblioteca, pero confiaba en que el <code>modelo</code> de React prevalecería por mucho más tiempo.</p>\n<h2>Cual es el “modelo” de React?</h2>\n<p>La explicación que se muestra aquí se basa en una descripción \"formalizada\" del repositorio <a href=\"https://github.com/reactjs/react-basic\">\"react-basic\"</a>. También explican que se trata de un intento de tener un modelo mental de cómo “funciona” el mecanismo interno, pero que en la práctica, como todo, es algo más complejo.</p>\n<h3>Transformación</h3>\n<blockquote>\n<p>La premisa central de React es que las interfaces de usuario son simplemente una proyección de datos en una \"forma diferente\". La misma entrada da la misma salida. Una simple función pura.</p>\n</blockquote>\n<p>He leído la frase citada de varios autores; como Erick Eliot y el propio React Team Core. Escribimos funciones todo el tiempo cuando desarrollamos software, funciones donde transformamos argumentos en una \"derivación\" de los mismos como respuesta.</p>\n<p>En React podemos tener:</p>\n<pre><code>function Greeting({ name }) {\n  return &#x3C;p>{`Hello, ${name}`}&#x3C;/p>;\n}\n</code></pre>\n<p>Y esto puede ser perfectamente lo mismo que esto:</p>\n<pre><code>function greeting(name) {\n  return `Hello, ${name}`;\n}\n</code></pre>\n<p>React mantiene la esencia de la programación en solo código Javascript.</p>\n<h3>Abstracción</h3>\n<p>Todos los problemas de software se resuelven con <a href=\"https://es.wikipedia.org/wiki/Indirecci%C3%B3n\">indirección</a>. Esta es la capacidad de referirnos a los datos de forma diferente a su valor y la aplicación de esta técnica en React es muy transparente.</p>\n<p>Nuevamente con el ejemplo anterior, la función (componente) <code>Greeting</code> nos permite referirnos a él sin tener que pensar que en realidad es un elemento DOM o un elemento en React, sabemos por su nombre y argumentos que podría presentar un un mensaje de saludo al nombre dado como un argumento.</p>\n<h3>Composición</h3>\n<p>La composición es la esencia de la programación, tomar un problema y dividirlo en partes más pequeñas para finalmente construir una solución completa combinando pequeñas soluciones.</p>\n<blockquote>\n<p>In my first high school programming class, I was told that software development is “the act of breaking a complex problem down into smaller problems, and composing simple solutions to form a complete solution to the complex problem.” — Erick Eliot</p>\n</blockquote>\n<p>React nos da la capacidad de desarrollar interfaces complejas a partir de pequeños elementos reutilizables de IU.</p>\n<pre><code>function Header() {\n  // we assume that we have a function\n  // from which we get a user\n  // in our application\n  const user = useUser();\n\n  // without having to modify the behavior\n  // of Greeting we can use the same element\n  // in different parts of our application\n  return (\n    &#x3C;div>\n      &#x3C;Greeting name={user.name} />\n      &#x3C;nav>\n        &#x3C;a href=\"/profile\">Perfil&#x3C;/a>\n      &#x3C;/nav>\n    &#x3C;/div>\n  );\n}\n</code></pre>\n<h3>State</h3>\n<p>Cuando miro otras bibliotecas similares a React, lo mas interesante siempre es su \"propuesta\" para manejar el estado de la aplicación.</p>\n<p>Las IU podrían ser proyecciones puras de los datos enviados desde cualquier origen a los clientes, pero hay un intermediario que no podemos controlar, el Usuario. El \"estado\" podría ser la combinación de los datos en nuestra aplicación y las interacciones del usuario.</p>\n<p>Entre sus diferentes ventajas, tenemos la capacidad de \"viajar en el tiempo\" conociendo el estado de la aplicación en un punto determinado, estos patrones se ven fuertemente representados en librerías como Redux.</p>\n<p>Una única función que se encarga de combinar las interacciones del usuario y los datos de la aplicación:</p>\n<pre><code>function countReducer(state, action) {\n  switch (action.type) {\n    case \"increment\": {\n      return { count: state.count + 1 };\n    }\n    case \"decrement\": {\n      return { count: state.count - 1 };\n    }\n    default: {\n      throw new Error(`Unhandled action type: ${action.type}`);\n    }\n  }\n}\n</code></pre>\n<p>Podemos describir las interacciones del usuario que implementan las posibles transformaciones de estado:</p>\n<pre><code>function increment() {\n  dispatch({ type: \"increment\" });\n}\n</code></pre>\n<h2>Más allá de JavaScript</h2>\n<p>En mi camino de aprendizaje he podido observar cómo funcionan las bibliotecas como SwiftUI y Flutter. En mi opinión, encajan bien con el \"modelo\" React.</p>\n<p>Es claro ver que, no importa que nuevas bibliotecas o tecnologías aparezcan, muchas de ellas conservan la misma escénica que descubrí en React.</p>\n<p>Finalmente es importante mencionar que los puntos descritos aquí no son un invento nuevo del equipo de React, como mencione en varios puntos, estos son la escénica de la programación y verlos implementados de esta forma, a mi parecer elegante, es lo que me mantiene siempre motivado a seguir explorando React como tecnología.</p>\n<hr>\n<p>Algunos enlaces externos que utilizo como inspiración y referencia</p>\n<ul>\n<li><a href=\"https://github.com/reactjs/react-basic\">reactjs/react-basic</a></li>\n<li><a href=\"https://rauchg.com/2015/pure-ui\">Pure UI from Guillermo Rauch</a></li>\n<li><a href=\"https://developer.apple.com/xcode/swiftui/\">SwiftUI</a></li>\n<li><a href=\"https://developer.android.com/jetpack/compose\">Jetpack Compose</a></li>\n<li><a href=\"https://flutter.dev/\">Flutter</a></li>\n<li><a href=\"https://xstate.js.org/\">XState</a></li>\n</ul>\n","cover":{"alt":"selective focus photography of multicolored confetti lot photo – Free Texture Image on Unsplash by @ninjason","src":"react-in-theory.jpg"},"excerpt":"Probable que en el futuro algo pudiera reemplazar a React como biblioteca, confió en que el `modelo` de React prevalecería por mucho más tiempo."}},"__N_SSG":true}