{"pageProps":{"post":{"title":"La ultima vez que cambie de trabajo","date":"2021-08-22T00:00:00.000Z","slug":"new-job","content":"<p>La última vez que cambié de trabajo, también cambió mi perspectiva al ver las ofertas de empleo. En aquel momento, estaba terminando la relación con un proyecto en el cual colaboraba y reflexionaba sobre cuál iba a ser el siguiente proyecto en el que me tocaría colaborar.</p>\n<p>La empresa para la que trabajaba pertenecía al modelo de empresas de software muy común en México y otros países latinoamericanos, haciendo nearshore para empresas de Estados Unidos o el extranjero. Por lo tanto, una vez terminada la relación de trabajo con un cliente, tendrías que ser asignado al siguiente y así sucesivamente mientras dures en esa empresa.</p>\n<p>Un par de años antes, ya había identificado una realidad con la que no estaba de acuerdo. Me tocó ser parte de dos proyectos bajo este mismo modelo y me di cuenta de que realmente no disfrutaba trabajar para ellos. No compartía la visión ni el objetivo de la empresa y solo estaba ahí porque ese era mi trabajo.</p>\n<p>Durante ese momento, vivía el siguiente mantra:</p>\n<blockquote>\n<p>Es responsable aceptar cosas con las que no estamos de acuerdo.</p>\n</blockquote>\n<p>En ese momento, aquel mantra me hacía mucho sentido. No siempre íbamos a estar de acuerdo con las situaciones que se daban en nuestras vidas, y es responsable enfrentar y afrontar esas situaciones.</p>\n<p>Estos dos proyectos estaban basados en una estrategia de Outsourcing llamada <em>\"Staff augmentation\"</em>, donde básicamente tú trabajas para una empresa y eres asignado como recurso al equipo del cliente.</p>\n<p>Durante este tiempo, me tocó colaborar en otro proyecto más, este era 100% in-house. Tomábamos requerimientos del cliente, pero nosotros nos hacíamos cargo del resto. Este proyecto en particular sí me gustó bastante.</p>\n<p>Para mí, la gran diferencia entre estos modelos es que en aquel que disfruté bastante, el equipo funcionaba de forma integral. Generabas una buena confianza con tus compañeros y era muy fácil compartir la visión del proyecto. Mientras que en el otro, tenías que creer en lo que el equipo del cliente creía y casarte con la visión del producto sin tener tiempo para conocerlo completamente.</p>\n<p>Usualmente, las empresas que trabajan bajo este modelo están tratando de desarrollar alguna funcionalidad muy puntual, algún MVP que posteriormente el cliente se pueda llevar y validar de forma rápida sin tener que invertir recursos en desarrollarlo, mantenimiento de sistemas legacy que nadie quiere tocar o tal vez crear un producto disruptivo completamente fantástico que marcará la nueva generación de un mercado. Pero todo esto, al final, es una moneda al aire.</p>\n<p>También creo que puedes generar una buena integración con el equipo de trabajo en los modelos de Staff, pero al ser un agente externo, se suele crear un entorno donde todos entienden que tú estarás ahí de forma temporal. No tienes mucho tiempo para compartir los retos que el equipo ya hubiera experimentado en el pasado y no permanecerás lo suficiente para generar <em>\"the skin in the game\"</em>.</p>\n<h2>Buscando a tu empresa soñada</h2>\n<p>Durante este proceso de reflexión, me quedó muy claro con quién sí quería trabajar y con quién no. Comencé a investigar a las empresas con las que me sentía más cercano, ya fuera como usuario o porque seguía sus historias y logros de cerca. Personalmente, me encantan los productos financieros o educativos, empresas que estén generando un cambio importante en los servicios financieros o plataformas de educación en línea.</p>\n<p>Finalmente entendí que solo así podría encontrar más empresas que usaran ese modelo que tanto me gustó, ya que es más fácil compartir la visión de una empresa cuando esta se alinea con tus objetivos, además de generar ese sentimiento de pertenencia al equipo de la empresa.</p>\n<p>Lo único que le faltaba a este modelo que tanto me gustaba era <em>\"amar\"</em> el producto que estabas construyendo. En ese momento fue divertido trabajar con ese equipo, pero creo que se hubiera perdido el encanto al trabajar a largo plazo en él, ya que no le veía sentido a la dirección del producto.</p>\n<p>Considero que es importante <em>\"enamorarse\"</em> del proyecto en el que estás trabajando, ya que solo así vas a explotar tu potencial al máximo y, de lo contrario, incluso podría ser nocivo para el proyecto.</p>\n<p>He conocido fundadores con los que mi visión simplemente no se alinea. Están construyendo y poniendo su pasión, tiempo y esfuerzo en un proyecto que yo no puedo <em>\"amar\"</em> de la misma forma que ellos lo hacen e, incluso, puedo poner en riesgo el éxito del mismo, ya que me será muy difícil entender el diferencial que estamos tratando de lograr.</p>\n<h2>No te personifiques como una persona técnica</h2>\n<p>Como el estudiante de Ingeniería que fui, creo que muchos tenían la misma idea al graduarse: crear o trabajar para una empresa que se encargará de desarrollar productos de software para otras empresas, un modelo muy similar a las fábricas. Otros veían más el modelo de consultoría de software, donde uno, como \"profesional\" en el área, brinda soporte a otras empresas de diferentes ramos con sus soluciones tecnológicas. Y finalmente, el sueño de todo desarrollador: trabajar en Microsoft, Google, Facebook, etc.</p>\n<p>Para una pequeña <a href=\"https://www.beyond.dev/people-stories/jerome-olvera\">entrevista que tuve con el equipo de Beyond</a>, dije algo como:</p>\n<blockquote>\n<p>\"No te personifiques como una persona técnica, sé un colaborador que quiere ayudar a toda la empresa.\"</p>\n</blockquote>\n<p>Este nuevo mantra me ayudó a desechar la idea de que <em>\"era responsable aceptar cosas con las que no estamos de acuerdo\"</em>. <strong>No</strong> está bien aceptar cosas con las que no estás de acuerdo.</p>\n<p>Como profesional de cualquier área, cuentas con habilidades técnicas que te permiten desarrollar algún objetivo, como: desarrollar software, hacer contabilidad o quizás tener las habilidades artísticas para pintar una gran obra.</p>\n<p>Si estas habilidades no tienen un enfoque, difícilmente serán útiles, porque puedes ser la persona con el conocimiento matemático más grande del mundo, ¿pero con qué propósito? Y cuando hablo de ser un colaborador más que solo una persona técnica, me refiero a que encuentres TU objetivo y apliques todo lo que sabes en materia técnica para cumplirlo.</p>\n<p>Recuerda el famoso <em>\"You've Got to Find What You Love\"</em> de Steve Jobs. Creo que puedo interpretar que no tienes que ser un ciego persiguiendo tus sueños, pero sí tener un objetivo y enfocarte en aquello para lo que eres muy bueno y cumplirlo, solo o de la mano de alguien más con quien puedas alinear tus metas.</p>\n<blockquote>\n<p>The only way to be truly satisfied is to do what you believe is great work.</p>\n</blockquote>\n<h2>Conclusion</h2>\n<p>No creo que todo en el Nearshore, Outsourcing o Consultoría sean aspectos negativos; de hecho, son increíbles oportunidades para todos. Es una forma accesible de trabajar con empresas que tienen una perspectiva diferente, las cosas en las empresas extranjeras pueden llegar a ocurrir muy rápido, se toman decisiones agresivas y la competitividad técnica es alta. Por lo tanto, creo que son los mejores lugares para comenzar tu carrera y llevarla hasta el mediano plazo.</p>\n<p>Tampoco creo que siempre haya que apuntar a trabajar en las empresas más reconocidas. Es posible que ahí se encuentren los mejores de los mejores a nivel técnico, pero recuerda que tienes que creer en lo mismo que esas empresas creen.</p>\n<p>Finalmente, existe una gran oportunidad de aprender y de potenciar tus habilidades a lo largo de tu carrera al asumir la responsabilidad (<em>ownership</em>) de tus objetivos. Este último video (que también es de Steve Jobs), habla sobre <a href=\"https://www.youtube.com/watch?v=4n6LrehCPOQ\">\"Skin In The Game\"</a> y lo que puede suceder cuando pasas mucho tiempo construyendo objetivos que no son tuyos.</p>\n","cover":{"alt":"black framed eyeglasses on white surface photo – Free Business Image on Unsplash by @konseptastudio","src":"new-job.jpg"},"excerpt":"No te personifiques como una persona técnica, sé un colaborador que quiere ayudar a toda la empresa. Entiende el objetivo en el que tú crees y el objetivo en el que cree tu empresa."}},"__N_SSG":true}